// void Zadacha24()
// {
// // Задача 24: Напишите программу, которая принимает на вход число (А) и выдаёт сумму чисел от 1 до А.
int number = 5;
int sum = 0;

for (int i = 1; i <= number; i++)
{
    // Console.Write($"{i}");
    sum += i;
}
    Console.Write($"{sum}");

Zadacha24();

